# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [59]:
import pandas as pd
pd.DataFrame()
import pymysql
from sqlalchemy import create_engine

engine=create_engine('mysql+pymysql://root:PASSWORD@localhost/sakila')
data = pd.read_sql_query('SELECT * FROM sakila.actor', engine)
data


#from sqlalchemy import inspect
#inspector=inspect(engine)
#inspector.get_table_names()

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

# Challenge 2 - Working with JSON files

Import the pandas library.

In [2]:
import pandas as pd
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [3]:
import os
os.chdir('C:/Users/Kasia/TEST/806_Repo/Labs/module_1/Importing-Exporting-Data/data')
os.listdir()
nasa=pd.read_json('nasa.json', orient='records')

Now that we have loaded the data, let's examine it using the `head()` function.

In [4]:
nasa.head(100)

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000
...,...,...,...,...,...,...,...,...,...,...,...,...
95,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-8.15, 32.25]}",30443,25000.0,Benguerir,Valid,LL6,32.25000,-8.15000,2004-01-01T00:00:00.000
96,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.8, 32.866...",5018,19000.0,Beni M'hira,Valid,L6,32.86667,10.80000,2001-01-01T00:00:00.000
97,34.0,1869.0,Fell,"{'type': 'Point', 'coordinates': [-89.15, 39.0...",5021,1770.5,Benld,Valid,H6,39.08333,-89.15000,1938-01-01T00:00:00.000
98,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [28.41667, -2...",5023,3880.0,Benoni,Valid,H6,-26.16667,28.41667,1943-01-01T00:00:00.000
99,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-7, 30]}",5024,45000.0,Bensour,Valid,LL6,30.00000,-7.00000,2002-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [12]:
#nasa.count(axis=0, level=None, numeric_only=False)
nasa.fall.value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [6]:
#nasa.to_json('nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [43]:
cols = ["missing_name",'time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [48]:
import pandas as pd
shuttle=pd.read_csv(tst_url, sep=" ")
#shuttle_df = pd.DataFrame(shuttle) - pd.read creates shuttle as a DataFrame
shuttle.columns=cols

Let's verify that this worked by looking at the `head()` function.

In [49]:
shuttle.head()

,missing_name,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
0,56,0,96,0,52,-4,40,44,4,4
1,50,-1,89,-7,50,0,39,40,2,1
2,53,9,79,0,42,-2,25,37,12,4
3,55,2,82,0,54,-6,26,28,2,1
4,41,0,84,3,38,-4,43,45,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [51]:
import os
os.chdir('C:/Users/Kasia/TEST/806_Repo/Labs/module_1/Importing-Exporting-Data/data')
os.listdir()
data.to_csv('shuttle.tst', sep=',', index=False)
os.listdir()

['astronauts.xls', 'nasa.json', 'shuttle.tst']

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [61]:
!pip install xlrd
import xlrd
astronaut = pd.read_excel(astronauts.xslx)
astronaut.head()

Requirement already satisfied: xlrd in c:\users\kasia\anaconda3\lib\site-packages (1.2.0)

NameError: name 'astronauts' is not defined

Use the `head()` function to inspect the dataframe.

In [1]:
astronaut.head()

NameError: name 'astronaut' is not defined

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [13]:
astronaut.XXXXX.value_counts()

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [14]:
data.to_csv("astrnaut.csv",sep="\t", index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!